app/controllers/store_controller.rb

  def index
    @stores = Store.paginate(:page => params[:page] || 1, :per_page => 10)
---
SELECT * FROM `stores` LIMIT 0, 10
SELECT count(*) AS count_all FROM `stores`

  def create
    @store = Store.new(params[:store])

    if @store.save
---
INSERT INTO `stores` (`name`, `city`, `created_at`, `updated_at`) VALUES('Gristides', 'New York', '2010-08-04 00:39:42', '2010-08-04 04:39:42')

  def show
    @store = Store.find(params[:id])
---
SELECT * FROM `stores` WHERE (`stores`.`id` = 1)

  def edit
    @store = Store.find(params[:id])
---
SELECT * FROM `stores` WHERE (`stores`.`id` = 2)

  def update
    @store = Store.find(params[:id])
    @store.name = params[:store][:name]
    @store.city = params[:store][:city]

    if @store.save
---
SELECT * FROM `stores` WHERE (`stores`.`id` = 2)
UPDATE `stores` SET `updated_at` = '2010-08-05 02:29:06', `name` = 'Gristedes Inc' WHERE `id` = 1

  def destroy
    if Store.delete(params[:id])
---
DELETE FROM `stores` WHERE (`id` IN ('3'))

  def sort
    @sort  = params[:sort]
    @order = params[:order]
    @page  = params[:page] || 1

    @stores = Store.paginate(:page => @page, :order => "#{@sort} #{@order}", :per_page => 10)
---
SELECT * FROM `stores` ORDER BY name DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `stores`